tutorials/multiphase/multiphaseEulerFoam/RAS/bubblePipe/system/singleGraph
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  dev
     \\/     M anipulation  |
-------------------------------------------------------------------------------
Description
    Writes graph data for specified fields along a line, specified by start
    and end points.

\*---------------------------------------------------------------------------*/

start   (0     0 0.89);
end     (0.025 0 0.89);
fields
(
    alpha.air1
    alpha.air2
    alpha.bubbles
    liftForce.water
    wallLubricationForce.water
    turbulentDispersionForce.water
);

// Sampling and I/O settings
#includeEtc "caseDicts/postProcessing/graphs/sampleDict.cfg"

// Override settings here, e.g.
/*
setConfig
{
    type lineCell;
    axis x;        // y, z, xyz
}
*/

// Must be last entry
#includeEtc "caseDicts/postProcessing/graphs/graph.cfg"

// ************************************************************************* //
